In [31]:
# NIM/Nama  : 19622217/Lydia Gracia
# Tanggal   :
# Deskripsi : Program memeriksa ...; input: ...; output: ...

# KAMUS
'''jenis data variabel'''
'''contoh: int, str, bool'''

'contoh: int, str, bool'

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

df=pd.read_csv("problem-6-3.csv")

print(df)

          maskapai asal tujuan  tahun  penumpang    harga
0            macan  JOG    SRG   2014        126  2414238
1     country link  BTO    BTH   2016        141  2707440
2            macan  BDO    SRG   2016        189  3751886
3         rajawali  BDO    PDG   2017        117  2224218
4       water asia  KNO    BTH   2015         82  1473728
...            ...  ...    ...    ...        ...      ...
9957         macan  BTO    BTH   2016        152  2955327
9958      rajawali  KNO    HLP   2014        197  3922810
9959  country link  KNO    HLP   2016        193  3986309
9960         macan  BDO    HLP   2016         91  1675138
9961  country link  CGK    SRG   2015        141  2711080

[9962 rows x 6 columns]

1

In [2]:
len(df)

9962

2

In [3]:
df.loc[df["harga"]==1999999]

      maskapai asal tujuan  tahun  penumpang    harga
6435  rajawali  SRG    BDO   2017        101  1999999

3

In [4]:
len(df.loc[df["harga"]>3500000])

1662

4

In [5]:
df.loc[(df["tahun"]==2014) & (df["tujuan"]!="PDG")]

        maskapai asal tujuan  tahun  penumpang    harga
0          macan  JOG    SRG   2014        126  2414238
8     water asia  KNO    SRG   2014        181  3576370
11         macan  JOG    UPG   2014         60  1018254
19    water asia  PKU    UPG   2014         94  1745372
22      rajawali  CGK    DPS   2014        199  3957458
...          ...  ...    ...    ...        ...      ...
9936  water asia  JOG    UPG   2014         74  1315633
9946    rajawali  JOG    SRG   2014        116  1943266
9947     mataram  BTO    DPS   2014        173  3406653
9949  water asia  JOG    UPG   2014         91  3392935
9958    rajawali  KNO    HLP   2014        197  3922810

[2115 rows x 6 columns]

5

In [6]:
macan=df.loc[df["maskapai"]=="macan"]

macan.loc[macan["harga"]==macan["harga"].min()]

     maskapai asal tujuan  tahun  penumpang    harga
7121    macan  BTO    BTH   2016         60  1005234

6

In [8]:
rajawali=df.loc[df["maskapai"]=="rajawali"]

rajawali.sort_values(["penumpang", "harga"], ascending=[False, True])[:10]

      maskapai asal tujuan  tahun  penumpang    harga
835   rajawali  KNO    BTH   2015        200  2191958
2192  rajawali  BDO    SRG   2016        200  3405316
8102  rajawali  PKU    SRG   2017        200  3969784
1216  rajawali  CGK    SRG   2016        200  3971021
6139  rajawali  PKU    PDG   2017        200  3973524
7175  rajawali  BDO    UPG   2016        200  3977544
9160  rajawali  KNO    DPS   2015        200  3978077
2721  rajawali  PKU    PDG   2015        200  3980327
2745  rajawali  BDO    UPG   2017        200  3980449
9447  rajawali  BDO    PDG   2016        200  3982286

7

In [9]:
cl=df.loc[df["maskapai"]=="country link"]

cl["tahun"].value_counts()

2015    507
2014    502
2017    502
2016    496
Name: tahun, dtype: int64

8

In [10]:
df["harga"].mean()

2500099.7133105802

9

In [11]:
mataram=df.loc[df["maskapai"]=="mataram"]

mataram["penumpang"].std()

41.18986434514762

10

In [12]:
cl=df.loc[df["maskapai"]=="country link"]

cl["harga"].mean()

2515655.4907822623

11

In [13]:
print(df["penumpang"].corr(df["harga"])) # berkorelasi positif

0.917927324236429